Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.#ctor(Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelSummary,Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion)
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo class using DTOs.
modelSummaryDTO: Model information as provided from the Cloud DTO
modelVersionDTO: Version information as provided from the Cloud DTO
region: Region from cloud model location
Throws System.ArgumentNullException: Cloud information not provided

Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.#ctor(System.String,System.String,System.String,Tekla.Structures.ModelInternal.BimModelDataProduct.Types.BimModelDataApiRegion,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String)
Overload to the constructor for creating a model info instance with basic identity properties.
Used for unit testing.
If we have no such overload, unit testing will become impossible due to tight-coupling with the ModelService.
name: Name of the model
modelId: Model unique identifier in the cloud
versionId: Model version unique identifier in the cloud
region: Region where the model is stored in the cloud
modelSchemaVersion: The model schema version
modelType: The model type
modelOwnerId: The model owner id
modelCreatedBy: User that created the model
modelUpdatedBy: User that last updated the model
versionSchemaVersion: The schema of the given version
versionCreatedBy: User that created the version
versionDescription: The version description
versionUpdatedBy: User that last updated the version

Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.ModelInfo


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionSchemaVersion


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionCreatedAt


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionUpdatedAt


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionCreatedBy


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionDescription


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionUpdatedBy


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionAuthor


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.FriendlyVersion


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.Branch


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionId


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.FromVersion(Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelInfo,Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion)
Creates a new instance of Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo from a parent model and a version DTO.
parentModel: The model that the version belongs to
versionDto: The version information fetched from the cloud
Returns: The cloud Model Info created from parent + version information
Throws System.NotSupportedException: Provided parentModel is not a CloudModelInfo

Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.Equals(System.Object)


Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.Equals(Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo)
Determines whether the current instance is equal to another Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo instance.
Remarks: Two instances are considered equal if their Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.ModelInfo properties are the
same and their Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.VersionId properties are equal when compared using a case-insensitive,
culture-invariant comparison.
other: The Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo instance to compare with the current instance, or null.
Returns: true if the specified Tekla.Structures.ModelInternal.BimModelDataProduct.ICloudModelVersionInfo instance is equal to the current
instance; otherwise, false.

Tekla.Structures.ModelInternal.BimModelDataProduct.CloudModelVersionInfo.GetHashCode
